Revit 2026 API

# NoiseType Enumeration

---

The enumerated type representing the permitted values for the asset property "NoiseType" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum NoiseType
```
```vb
Public Enumeration NoiseType
```
```cpp
public enum class NoiseType
```
```fsharp
type NoiseType
```

| Member name | Value | Description |
| --- | --- | --- |
| Fractal | 1 |  |
| Regular | 0 |  |
| Turbulence | 2 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace